app/controllers/home_controller.rb

    def set_personal
      @personal = Personal.find_by(user_id: current_user.id)
---
SELECT  `personals`.* FROM `personals` WHERE `personals`.`user_id` = 4 LIMIT 1