app/controllers/personals_controller.rb

    def set_personal
      @personal = Personal.find(params[:id])
---
SELECT  `personals`.* FROM `personals` WHERE `personals`.`id` = 5 LIMIT 1