app/controllers/personals_controller.rb

SELECT `personals`.* FROM `personals`
---
  def index
    @personals = Personal.all

INSERT INTO `personals` (`user_id`, `name`, `kana`, `sex`, `created_at`, `updated_at`) VALUES (2, 'so', 'ソウ', 2, '2018-03-26 17:06:21', '2018-03-26 17:06:21')
---
  def create
    @personal = Personal.new(personal_params)

    respond_to do |format|
      if params[:back]
        format.html { render :new }
        format.json { render json: @personal.errors, status: :unprocessable_entity }
      elsif @personal.save

UPDATE `personals` SET `birth` = '2018-03-27', `updated_at` = '2018-03-27 12:40:14' WHERE `personals`.`id` = 5
---
  def update
    respond_to do |format|
      if @personal.update(personal_params)

SELECT  `personals`.* FROM `personals` WHERE `personals`.`user_id` = 5 LIMIT 1
---
    def set_personal
      @personal = Personal.find_by(user_id: current_user.id)